In [1]:
import numpy as np
import pandas as pd

# Pandas utility functions
Similarly to numpy, pandas also has a few utility functions to identify and detect null values:

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

In [6]:
#Opposite one also exist
pd.notnull(np.nan)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notna(np.nan)

False

In [9]:
pd.notnull(3)

True

In [10]:
#These functions also work with Series and DataFrames
pd.isnull(pd.Series([23,np.nan,29]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({
    'column A':[1,np.nan,7],
    'column B':[np.nan,2,3],
    'column c':[np.nan,2,np.nan]
}))

   column A  column B  column c
0     False      True      True
1      True     False     False
2     False     False      True

# Pandas Operations with Missing Values
Pandas manages missing values more gracefully than numpy. nans will no longer behave as "viruses", and operations will just ignore them completely:

In [12]:
pd.Series([1,2,np.nan]).count()

2

In [13]:
pd.Series([2,3,np.nan]).sum()

5.0

In [14]:
pd.Series([2,3,np.nan]).mean()

2.5

# Filtering missing data
As we saw with numpy, we could combine boolean selection + pd.isnull to filter out those nans and null values:

In [15]:
s=pd.Series([1,2,3,np.nan,np.nan,4])

In [16]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [17]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [18]:
pd.notnull(s).sum()

4

In [19]:
pd.isnull(s).sum()

2

In [20]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [21]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [22]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping null values
Boolean selection + notnull() seems a little bit verbose and repetitive. Any repetitive task will probably have a better, more DRY way. In this case, we can use the dropna method

In [23]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [24]:
#remove NA 
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping Null Values on DataFrame

In [25]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})

In [26]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [28]:
df.shape

(4, 4)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [31]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [32]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [33]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In this case we're dropping rows. Rows containing null values are dropped from the DF. You can also use the axis parameter to drop columns containing null values:

In [36]:
df.dropna(axis=1)

   Column D
0         5
1         8
2        34
3       110

In this case, any row or column that contains at least one null value will be dropped. Which can be, depending on the case, too extreme. You can control this behavior with the how parameter. Can be either 'any' or 'all':

In [38]:
df2=pd.DataFrame({
    'Column A':[2,3,np.nan],
    'Column B':[4,np.nan,5],
    'Column C':[np.nan,np.nan,120]
})

df2

In [42]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [43]:
#default behavior
df.dropna(how='any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

You can also use the thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept

In [48]:
df.dropna(thresh=2)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [49]:
df.dropna(thresh=3,axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

# Filling null values
Sometimes instead than dropping the null values, we might need to replace them with some other value. This highly depends on your context and the dataset

In [50]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [51]:
#Filling nulls with a arbitrary value
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [52]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

Filling nulls with contiguous (close) values

The method argument is used to fill null values with other values close to that null one

In [53]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [54]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [55]:
#This can still leave null values at the extremes of the Series/DataFrame:
pd.Series([np.nan,3,np.nan,9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [58]:
pd.Series([1,np.nan,3,np.nan,9,np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    9.0
4    9.0
5    NaN
dtype: float64

# Filling null values on DataFrames
The fillna method also works on DataFrames, and it works similarly. The main differences are that you can specify the axis (as usual, rows or columns) to use to fill the values (specially for methods) and that you have more control on the values passed:

In [59]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [61]:
df.fillna({'Column A': 29, 'Column B': 0, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1      29.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      29.0       0.0     100.0       110

In [62]:
df.fillna(method='ffill',axis=0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [63]:
df.fillna(method='ffill', axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

# Checking if there are NAs
The question is: Does this Series or DataFrame contain any missing value? The answer should be yes or no: True or False. How can you verify it?

Example 1: Checking the length

If there are missing values, s.dropna() will have less elements than s

In [64]:
s.dropna().count()

4

In [65]:
missing_values=len(s.dropna())!=len(s)
missing_values

True

In [66]:
# There's also a count method, that excludes nans from its result
len(s)

6

In [67]:
s.count()

4

In [68]:
missing_values = s.count() != len(s)
missing_values

True

More Pythonic solution any

The methods any and all check if either there's any True value in a Series or all the values are True. They work in the same way as in Python

In [69]:
pd.Series([True, False, False]).any()

True

In [70]:
pd.Series([True, False, False]).all()

False

In [71]:
pd.Series([1, np.nan]).isnull().any()

True

In [72]:
pd.Series([1, 2]).isnull().any()

False

In [73]:
s.isnull().any()

True

In [74]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [75]:
s.isnull().values.any()

True